Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1297NCZAD.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <prependToName>UART1</prependToName>
      <baseAddress>0x4000D000</baseAddress>
      <interrupt><name>UART1</name><value>6</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART2</name>
      <prependToName>UART2</prependToName>
      <baseAddress>0x4000E000</baseAddress>
      <interrupt><name>UART2</name><value>33</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART3</name>
      <prependToName>UART3</prependToName>
      <baseAddress>0x4000F000</baseAddress>
      <interrupt><name>UART3</name><value>56</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART4</name>
      <prependToName>UART4</prependToName>
      <baseAddress>0x40010000</baseAddress>
      <interrupt><name>UART4</name><value>57</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART5</name>
      <prependToName>UART5</prependToName>
      <baseAddress>0x40011000</baseAddress>
      <interrupt><name>UART5</name><value>58</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART6</name>
      <prependToName>UART6</prependToName>
      <baseAddress>0x40012000</baseAddress>
      <interrupt><name>UART6</name><value>59</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART7</name>
      <prependToName>UART7</prependToName>
      <baseAddress>0x40013000</baseAddress>
      <interrupt><name>UART7</name><value>60</value></interrupt>
    </peripheral>
    <peripheral>
      <name>I2C0</name>
      <description>Register map for I2C0 peripheral</description>
      <groupName>I2C</groupName>
      <prependToName>I2C0</prependToName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>I2C0</name><value>8</value></interrupt>
      <registers>
        <register>
          <name>MSA</name>
          <description>I2C Master Slave Address</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>I2C_MSA_RS</name>
              <description>Receive not send</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MSA_SA</name>
              <description>I2C Slave Address</description>
              <bitRange>[7:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCS</name>
          <description>I2C Master Control/Status</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>I2C_MCS_RUN</name>
              <description>I2C Master Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_START</name>
              <description>Generate START</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ADRACK</name>
              <description>Acknowledge Address</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ACK</name>
              <description>Data Acknowledge Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ARBLST</name>
              <description>Arbitration Lost</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_IDLE</name>
              <description>I2C Idle</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_BURST</name>
              <description>Burst Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_CLKTO</name>
              <description>Clock Timeout Error</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ACTDMATX</name>
              <description>DMA TX Active Status</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ACTDMARX</name>
              <description>DMA RX Active Status</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCS</name>
          <description>I2C Master Control/Status</description>
          <alternateGroup>I2C0_ALT</alternateGroup>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>I2C_MCS_BUSY</name>
              <description>I2C Busy</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ERROR</name>
              <description>Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_STOP</name>
              <description>Generate STOP</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_DATACK</name>
              <description>Acknowledge Data</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_HS</name>
              <description>High-Speed Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_QCMD</name>
              <description>Quick Command</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_BUSBSY</name>
              <description>Bus Busy</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MDR</name>
          <description>I2C Master Data</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>I2C_MDR_DATA</name>
              <description>This byte contains the data transferred during a transaction</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MTPR</name>
          <description>I2C Master Timer Period</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>I2C_MTPR_TPR</name>
              <description>Timer Period</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>I2C_MTPR_HS</name>
              <description>High-Speed Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>I2C_MTPR_PULSEL</name>
              <description>Glitch Suppression Pulse Width</description>
              <bitRange>[18:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_BYPASS</name>
                  <description>Bypass</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_1</name>
                  <description>1 clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_2</name>
                  <description>2 clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_3</name>
                  <description>3 clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_4</name>
                  <description>4 clocks</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_8</name>
                  <description>8 clocks</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_16</name>
                  <description>16 clocks</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MTPR_PULSEL_31</name>
                  <description>31 clocks</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MIMR</name>
          <description>I2C Master Interrupt Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>I2C_MIMR_IM</name>
              <description>Master Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_CLKIM</name>
              <description>Clock Timeout Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_DMARXIM</name>
              <description>Receive DMA Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_DMATXIM</name>
              <description>Transmit DMA Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_NACKIM</name>
              <description>Address/Data NACK Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_STARTIM</name>
              <description>START Detection Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_STOPIM</name>
              <description>STOP Detection Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_ARBLOSTIM</name>
              <description>Arbitration Lost Interrupt Mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_TXIM</name>
              <description>Transmit FIFO Request Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_RXIM</name>
              <description>Receive FIFO Request Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_TXFEIM</name>
              <description>Transmit FIFO Empty Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_RXFFIM</name>
              <description>Receive FIFO Full Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MRIS</name>
          <description>I2C Master Raw Interrupt Status</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>I2C_MRIS_RIS</name>
              <description>Master Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_CLKRIS</name>
              <description>Clock Timeout Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_DMARXRIS</name>
              <description>Receive DMA Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_DMATXRIS</name>
              <description>Transmit DMA Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_NACKRIS</name>
              <description>Address/Data NACK Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_STARTRIS</name>
              <description>START Detection Raw Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_STOPRIS</name>
              <description>STOP Detection Raw Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_ARBLOSTRIS</name>
              <description>Arbitration Lost Raw Interrupt Status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_TXRIS</name>
              <description>Transmit Request Raw Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_RXRIS</name>
              <description>Receive FIFO Request Raw Interrupt Status</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_TXFERIS</name>
              <description>Transmit FIFO Empty Raw Interrupt Status</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_RXFFRIS</name>
              <description>Receive FIFO Full Raw Interrupt Status</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MMIS</name>
          <description>I2C Master Masked Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>I2C_MMIS_MIS</name>
              <description>Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_CLKMIS</name>
              <description>Clock Timeout Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_DMARXMIS</name>
              <description>Receive DMA Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_DMATXMIS</name>
              <description>Transmit DMA Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_NACKMIS</name>
              <description>Address/Data NACK Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_STARTMIS</name>
              <description>START Detection Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_STOPMIS</name>
              <description>STOP Detection Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_ARBLOSTMIS</name>
              <description>Arbitration Lost Interrupt Mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_TXMIS</name>
              <description>Transmit Request Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_RXMIS</name>
              <description>Receive FIFO Request Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_TXFEMIS</name>
              <description>Transmit FIFO Empty Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_RXFFMIS</name>
              <description>Receive FIFO Full Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MICR</name>
          <description>I2C Master Interrupt Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>I2C_MICR_IC</name>
              <description>Master Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_CLKIC</name>
              <description>Clock Timeout Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_DMARXIC</name>
              <description>Receive DMA Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_DMATXIC</name>
              <description>Transmit DMA Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_NACKIC</name>
              <description>Address/Data NACK Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_STARTIC</name>
              <description>START Detection Interrupt Clear</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_STOPIC</name>
              <description>STOP Detection Interrupt Clear</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_ARBLOSTIC</name>
              <description>Arbitration Lost Interrupt Clear</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_TXIC</name>
              <description>Transmit FIFO Request Interrupt Clear</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_RXIC</name>
              <description>Receive FIFO Request Interrupt Clear</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_TXFEIC</name>
              <description>Transmit FIFO Empty Interrupt Clear</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_RXFFIC</name>
              <description>Receive FIFO Full Interrupt Clear</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR</name>
          <description>I2C Master Configuration</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>I2C_MCR_LPBK</name>
              <description>I2C Loopback</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MCR_MFE</name>
              <description>I2C Master Function Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_MCR_SFE</name>
              <description>I2C Slave Function Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKOCNT</name>
          <description>I2C Master Clock Low Timeout Count</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>I2C_MCLKOCNT_CNTL</name>
              <description>I2C Master Count</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MBMON</name>
          <description>I2C Master Bus Monitor</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>I2C_MBMON_SCL</name>
              <description>I2C SCL Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MBMON_SDA</name>
              <description>I2C SDA Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MBLEN</name>
          <description>I2C Master Burst Length</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>I2C_MBLEN_CNTL</name>
              <description>I2C Burst Length</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MBCNT</name>
          <description>I2C Master Burst Count</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>I2C_MBCNT_CNTL</name>
              <description>I2C Master Burst Count</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SOAR</name>
          <description>I2C Slave Own Address</description>
          <addressOffset>0x00000800</addressOffset>
          <fields>
            <field>
              <name>I2C_SOAR_OAR</name>
              <description>I2C Slave Own Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
