Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1297NCZAD.svd
        <register>
          <name>DCCTL7</name>
          <description>ADC Digital Comparator Control 7</description>
          <addressOffset>0x00000E1C</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL7_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL7_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL7_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCCTL7_CTM</name>
              <description>Comparison Trigger Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL7_CTC</name>
              <description>Comparison Trigger Condition</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL7_CTE</name>
              <description>Comparison Trigger Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP0</name>
          <description>ADC Digital Comparator Range 0</description>
          <addressOffset>0x00000E40</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP0_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP0_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP1</name>
          <description>ADC Digital Comparator Range 1</description>
          <addressOffset>0x00000E44</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP1_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP1_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP2</name>
          <description>ADC Digital Comparator Range 2</description>
          <addressOffset>0x00000E48</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP2_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP2_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP3</name>
          <description>ADC Digital Comparator Range 3</description>
          <addressOffset>0x00000E4C</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP3_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP3_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP4</name>
          <description>ADC Digital Comparator Range 4</description>
          <addressOffset>0x00000E50</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP4_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP4_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP5</name>
          <description>ADC Digital Comparator Range 5</description>
          <addressOffset>0x00000E54</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP5_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP5_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP6</name>
          <description>ADC Digital Comparator Range 6</description>
          <addressOffset>0x00000E58</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP6_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP6_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP7</name>
          <description>ADC Digital Comparator Range 7</description>
          <addressOffset>0x00000E5C</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP7_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP7_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>ADC Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>ADC_PP_MCR</name>
              <description>Maximum Conversion Rate</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PP_MCR_FULL</name>
                  <description>Full conversion rate (FCONV) as defined by TADC and NSH</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_PP_CH</name>
              <description>ADC Channel Count</description>
              <bitRange>[9:4]</bitRange>
            </field>
            <field>
              <name>ADC_PP_DC</name>
              <description>Digital Comparator Count</description>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>ADC_PP_TYPE</name>
              <description>ADC Architecture</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PP_TYPE_SAR</name>
                  <description>SAR</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_PP_RSL</name>
              <description>Resolution</description>
              <bitRange>[22:18]</bitRange>
            </field>
            <field>
              <name>ADC_PP_TS</name>
              <description>Temperature Sensor</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADC_PP_APSHT</name>
              <description>Application-Programmable Sample-and-Hold Time</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <description>ADC Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <fields>
            <field>
              <name>ADC_PC_MCR</name>
              <description>Conversion Rate</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PC_MCR_1_8</name>
                  <description>Eighth conversion rate. After a conversion completes, the logic pauses for 112 TADC periods before starting the next conversion</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_MCR_1_4</name>
                  <description>Quarter conversion rate. After a conversion completes, the logic pauses for 48 TADC periods before starting the next conversion</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_MCR_1_2</name>
                  <description>Half conversion rate. After a conversion completes, the logic pauses for 16 TADC periods before starting the next conversion</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_MCR_FULL</name>
                  <description>Full conversion rate (FCONV) as defined by TADC and NSH</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <description>ADC Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>ADC_CC_CS</name>
              <description>ADC Clock Source</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_CC_CS_SYSPLL</name>
                  <description>PLL VCO divided by CLKDIV</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_CC_CS_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_CC_CS_MOSC</name>
                  <description>MOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_CC_CLKDIV</name>
              <description>PLL VCO Clock Divisor</description>
              <bitRange>[9:4]</bitRange>
            </field>
          </fields>
        </register>
