Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1297NCZAD.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD0</name>
      <description>Register map for LCD0 peripheral</description>
      <groupName>LCD</groupName>
      <prependToName>LCD0</prependToName>
      <baseAddress>0x44050000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>LCD0</name><value>97</value></interrupt>
      <registers>
        <register>
          <name>PID</name>
          <description>LCD PID Register Format</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>LCD_PID_MINOR</name>
              <description>Minor Release Number</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>LCD_PID_MAJOR</name>
              <description>Major Release Number</description>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>LCD Control</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>LCD_CTL_LCDMODE</name>
              <description>LCD Mode Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCD_CTL_UFLOWRST</name>
              <description>Underflow Restart</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCD_CTL_CLKDIV</name>
              <description>Clock Divisor</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIDDCTL</name>
          <description>LCD LIDD Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>LCD_LIDDCTL_MODE</name>
              <description>LIDD Mode Select</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCD_LIDDCTL_MODE_SYNCM68</name>
                  <description>Synchronous Motorola 6800 Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_LIDDCTL_MODE_ASYNCM68</name>
                  <description>Asynchronous Motorola 6800 Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_LIDDCTL_MODE_SYNCM80</name>
                  <description>Synchronous Intel 8080 mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_LIDDCTL_MODE_ASYNCM80</name>
                  <description>Asynchronous Intel 8080 mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_LIDDCTL_MODE_ASYNCHIT</name>
                  <description>Asynchronous Hitachi mode</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCD_LIDDCTL_ALE</name>
              <description>Address Latch Enable (ALE) Polarity Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCTL_RDEN</name>
              <description>Read Strobe (RD) /Direct Enable (EN) Polarity Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCTL_WRDIRINV</name>
              <description>Write Strobe (WR) /Direction (DIR) Polarity Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCTL_CS0E0</name>
              <description>Chip Select 0 (CS0)/Enable 0 (E0) Polarity Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCTL_CS1E1</name>
              <description>Chip Select 1 (CS1)/Enable 1(E1) Polarity Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCTL_DMAEN</name>
              <description>LIDD DMA Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCTL_DMACS</name>
              <description>CS0/CS1 Select for LIDD DMA Writes</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIDDCS0CFG</name>
          <description>LCD LIDD CS0 Configuration</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>LCD_LIDDCS0CFG_GAP</name>
              <description>Field value defines the number of LCDMCLK cycles (GAP +1) between the end of one CS0 (LCDAC) device access and the start of another CS0 (LCDAC) device access unless the two accesses are both reads</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS0CFG_RDHOLD</name>
              <description>Read Strobe (RD) Hold cycles</description>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS0CFG_RDDUR</name>
              <description>Read Strobe (RD) Duration cycles</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS0CFG_RDSU</name>
              <description>Read Strobe (RD) Set-Up cycles</description>
              <bitRange>[16:12]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS0CFG_WRHOLD</name>
              <description>Write Strobe (WR) Hold cycles</description>
              <bitRange>[20:17]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS0CFG_WRDUR</name>
              <description>Write Strobe (WR) Duration Cycles</description>
              <bitRange>[26:21]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS0CFG_WRSU</name>
              <description>Write Strobe (WR) Set-Up Cycles</description>
              <bitRange>[31:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIDDCS0ADDR</name>
          <description>LIDD CS0 Read/Write Address</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>LCD_LIDDCS0ADDR_CS0ADDR</name>
              <description>LCD Address</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIDDCS0DATA</name>
          <description>LIDD CS0 Data Read/Write Initiation</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>LCD_LIDDCS0DATA_CS0DATA</name>
              <description>LCD Data Read/Write</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIDDCS1CFG</name>
          <description>LIDD CS1 Configuration</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>LCD_LIDDCS1CFG_GAP</name>
              <description>Field value defines the number of LCDMCLK cycles (GAP + 1) between the end of one CS1 (LCDAC) device access and the start of another CS0 (LCDAC) device access unless the two accesses are both reads</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS1CFG_RDHOLD</name>
              <description>Read Strobe (RD) Hold cycles</description>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS1CFG_RDDUR</name>
              <description>Read Strobe (RD) Duration cycles</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS1CFG_RDSU</name>
              <description>Read Strobe (RD) Set-Up cycles</description>
              <bitRange>[16:12]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS1CFG_WRHOLD</name>
              <description>Write Strobe (WR) Hold cycles</description>
              <bitRange>[20:17]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS1CFG_WRDUR</name>
              <description>Write Strobe (WR) Duration Cycles</description>
              <bitRange>[26:21]</bitRange>
            </field>
            <field>
              <name>LCD_LIDDCS1CFG_WRSU</name>
              <description>Write Strobe (WR) Set-Up Cycles</description>
              <bitRange>[31:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIDDCS1ADDR</name>
          <description>LIDD CS1 Address Read/Write Initiation</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>LCD_LIDDCS1ADDR_CS1ADDR</name>
              <description>LCD Address Bus</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LIDDCS1DATA</name>
          <description>LIDD CS1 Data Read/Write Initiation</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>LCD_LIDDCS1DATA_CS0DATA</name>
              <description>LCD Data Read/Write Initiation</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RASTRCTL</name>
          <description>LCD Raster Control</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>LCD_RASTRCTL_LCDEN</name>
              <description>LCD Controller Enable for Raster Operations</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRCTL_LCDBW</name>
              <description>LCD Monochrome</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRCTL_LCDTFT</name>
              <description>LCD TFT</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRCTL_RDORDER</name>
              <description>Raster Data Order Select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRCTL_MONO8B</name>
              <description>Mono 8-Bit</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRCTL_REQDLY</name>
              <description>Palette Loading Delay</description>
              <bitRange>[19:12]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRCTL_PALMODE</name>
              <description>Pallette Loading Mode</description>
              <bitRange>[21:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCD_RASTRCTL_PALMODE_PALDAT</name>
                  <description>Palette and data loading, reset value</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_RASTRCTL_PALMODE_PAL</name>
                  <description>Palette loading only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_RASTRCTL_PALMODE_DAT</name>
                  <description>Data loading only</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCD_RASTRCTL_NIBMODE</name>
              <description>Nibble Mode</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRCTL_TFTMAP</name>
              <description>TFT Mode Alternate Signal Mapping for Palettized Framebuffer</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRCTL_FRMBUFSZ</name>
              <description>Frame Buffer Select</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRCTL_TFT24</name>
              <description>24-Bit TFT Mode</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRCTL_TFT24UPCK</name>
              <description>24-bit TFT Mode Packing</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RASTRTIM0</name>
          <description>LCD Raster Timing 0</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>LCD_RASTRTIM0_MSBPPL</name>
              <description>Pixels-per-line MSB[10]</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM0_PPL</name>
              <description>Pixels-per-line LSB[9:4]</description>
              <bitRange>[9:4]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM0_HSW</name>
              <description>Horizontal Sync Pulse Width Lowbits</description>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM0_HFP</name>
              <description>Horizontal Front Porch Lowbits</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM0_HBP</name>
              <description>Horizontal Back Porch Lowbits</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RASTRTIM1</name>
          <description>LCD Raster Timing 1</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>LCD_RASTRTIM1_LPP</name>
              <description>Lines Per Panel</description>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM1_VSW</name>
              <description>Vertical Sync Width Pulse</description>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM1_VFP</name>
              <description>Vertical Front Porch</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM1_VBP</name>
              <description>Vertical Back Porch</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RASTRTIM2</name>
          <description>LCD Raster Timing 2</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>LCD_RASTRTIM2_MSBHFP</name>
              <description>Bits 9:8 of the horizontal front porch field</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM2_MSBHBP</name>
              <description>Bits 9:8 of the horizontal back porch field</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM2_ACBF</name>
              <description>AC Bias Pin Frequency</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM2_ACBI</name>
              <description>AC Bias Pins Transitions per Interrupt</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM2_IVS</name>
              <description>Invert Vsync</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM2_IHS</name>
              <description>Invert Hysync</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM2_INVPXLCLK</name>
              <description>Invert Pixel Clock</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM2_INVOE</name>
              <description>Invert Output Enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM2_PSYNCRF</name>
              <description>Program HSYNC/VSYNC Rise or Fall</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM2_PXLCLKCTL</name>
              <description>Hsync/Vsync Pixel Clock Control On/Off</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM2_MSBLPP</name>
              <description>MSB of Lines Per Panel</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRTIM2_HSW</name>
              <description>Bits 9:6 of the horizontal sync width field</description>
              <bitRange>[30:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RASTRSUBP1</name>
          <description>LCD Raster Subpanel Display 1</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>LCD_RASTRSUBP1_DPDLSB</name>
              <description>Default Pixel Data LSB[15:0]</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRSUBP1_LPPT</name>
              <description>Line Per Panel Threshold</description>
              <bitRange>[25:16]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRSUBP1_HOLS</name>
              <description>High or Low Signal</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRSUBP1_SPEN</name>
              <description>Sub Panel Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RASTRSUBP2</name>
          <description>LCD Raster Subpanel Display 2</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>LCD_RASTRSUBP2_DPDMSB</name>
              <description>Default Pixel Data MSB [23:16]</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>LCD_RASTRSUBP2_LPPTMSB</name>
              <description>Lines Per Panel Threshold Bit 10</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL</name>
          <description>LCD DMA Control</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>LCD_DMACTL_FMODE</name>
              <description>Frame Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCD_DMACTL_BIGDEND</name>
              <description>Big Endian Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCD_DMACTL_BYTESWAP</name>
              <description>This bit controls the bytelane ordering of the data on the output of the DMA module</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCD_DMACTL_BURSTSZ</name>
              <description>Burst Size setting for DMA transfers (all DMA transfers are 32 bits wide):</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCD_DMACTL_BURSTSZ_4</name>
                  <description>burst size of 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_DMACTL_BURSTSZ_8</name>
                  <description>burst size of 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_DMACTL_BURSTSZ_16</name>
                  <description>burst size of 16</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCD_DMACTL_FIFORDY</name>
              <description>DMA FIFO threshold</description>
              <bitRange>[10:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCD_DMACTL_FIFORDY_8</name>
                  <description>8 words</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_DMACTL_FIFORDY_16</name>
                  <description>16 words</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_DMACTL_FIFORDY_32</name>
                  <description>32 words</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_DMACTL_FIFORDY_64</name>
                  <description>64 words</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_DMACTL_FIFORDY_128</name>
                  <description>128 words</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_DMACTL_FIFORDY_256</name>
                  <description>256 words</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_DMACTL_FIFORDY_512</name>
                  <description>512 words</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
